{
  "main": {
    "name": "David Loder",
    "occupation": "Web Developer",
    "description": "I make web applications and sites using modern development tools",
    "image": "profilepic.jpeg",
    "bio": "I am an energetic but down to earth individual with a goal of becoming a professional web developer, I really like using Reactjs, Strapi CMS, and Node.js to create fully customizable websites and applications. I favor problem-solving potiential issues and love to tinker with ideas and solutions. Did I mention I also love coffee?",
    "contactmessage": "If you have any questions, or if you would like to get to know me, send me a message and lets talk!",
    "email": "davidloder92@gmail.com",
    "phone": "null",
    "address": {
      "street": "null",
      "city": "Mays Landing",
      "state": "New Jersey",
      "zip": "08330"
    },
    "website": "https://davidloder.com/",
    "resumedownload": "/assets/pdf/david-loder-resume/david-loder-resume.pdf",
    "gtag": "G-V70HNPTL6Z",
    "social": [
      {
        "name": "facebook",
        "url": "https://facebook.com/daveyloder",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/daveloder/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/daveyloder",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here is a short comparison of my skills and how they compare with my own progress.",
    "education": [
      {
        "school": "Temple University",
        "degree": "Bachelors in Information Science & Technology ",
        "GPA": 0.0,
        "graduated": "May 2024",
        "description": "I currently attend Temple University with the goal of earning a Bachelors of Science in Infromation Science & Technology. I have been challenged with the expectations the College of Technolgy requires in math subjects. I am not as skilled as my colleagues in Calculus, but I intend to practice discipline and overcome this hurdle. I am a apart of some of the local clubs here at Temple University such as ACM and TUDev. This has grown my network to better learn traits and skills that will help me in my career."
      },
      {
        "school": "Camden County College",
        "degree": "Associates in Liberal Arts",
        "GPA": 2.7,
        "graduated": "May 2016",
        "description": "While attending Camden County, I studied music but with experience taught me that it wasn't something I would pursue  as a career. I learned that it is okay to not know you path right away but as long as you have a plan, success will follow."
      }
    ],
    "work": [
      {
        "company": "BestBuy",
        "title": "Agent",
        "years": "August 2022 - Present",
        "description": "As a Geek Squad Home Theater Agent, I travel via a company owned vehicle from the precinct to our client’s home and assist with the delivery, installation, repair, and haul away of home theater technology products and equipment. I provide my clients service by handling appointments , asking questions to enhance the client experience, and providing prompt follow up of recommendations as well as solutions. As a Geek Squad Home Theater expert, I am responsible for completing fulfillment of intermediately complete work, while managing inventory and vehicle maintenance for our Geekmobiles in partnership with other Agents."
      },
      {
        "company": "BestBuy",
        "title": "Cadet",
        "years": "November 2021 - August 2022",
        "description": "As a Cadet, I traveled via company provided vehicle from the precinct to our client's home and assists with the delivery and basic installation of technology products alongside an Agent. They provided our clients service with handling their appointments, asking the right questions for what the client is expecting, and providing prompt follow up of recommendations as well as solutions. This was a great opportunity to build a career with Geek Squad by learning all about our products and services as well as knowledge in the Home Theater department of Geek Squad. It offers the chance to increase skills through training and on-the-job opportunities."
      },
      {
        "company": "Lenegan Plumbing & Heating",
        "title": "Data Enty / IT Support",
        "years": "March 2021 - November 2021",
        "description": "As a Data Entry Clerk, I was responsible for transferring data from paper formats into computer files for water meter records and files. Their transfer of data happens manually as well as importing photos into our database via Dropbox. I was also responsible for technical support for our offices as well as our installers in the field for anything related to troubleshooting and maintaining equipment."
      },
      {
        "company": "Mobile Outfitters",
        "title": "Production Team Member II ",
        "years": "January 2018- March 2021",
        "description": "Manufactured and assembled finished goods. Helped pack, store, and ship finished goods.Assembled and deployed tablets and vinyl machines for consumer use. Offering support in designing product coverage for consumer owned vinyl cutting machines."
      },
      {
        "company": "Carluccio's Coal Fired Pizza",
        "title": "Assistant General Manager",
        "years": "August 2017 - December 2017",
        "description": "Will include description shortly. Thanks for waiting!"
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "45%"
      },
      {
        "name": "HTML5",
        "level": "100%"
      },
      {
        "name": "CSS",
        "level": "30%"
      },
      {
        "name": "JavaScript",
        "level": "90%"
      },
      {
        "name": "ReactJs",
        "level": "70%"
      },
      {
        "name": "Node.js",
        "level": "40%"
      },
      {
        "name": "MongoDB",
        "level": "60%"
      },
      {
        "name": "Python",
        "level": "30%"
      },
      {
        "name": "Java",
        "level": "20%"
      },
      {
        "name": "Google Analytics",
        "level": "5%"
      }
    ]
  },
  "portfolio": {
    "rows": "bgrid-thirds",
    "projects": [
      {
        "title": "Adele Sand Therapy",
        "category": "A website I built for my mother's therapy business",
        "image": "adele-sand-therapy.png",
        "url": "https://www.adelesandtherapy.com"
      },
      {
        "title": "SC Prototypes",
        "category": "Website I built for a co-worker's model train restoration company",
        "image": "sc-prototypes.jpg",
        "url": "https://www.scprototypes.com"
      },
      {
        "title": "Funktional Fitness NYC",
        "category": "My first professional website I built for my uncle who owns and runs a mobile personal training business in the Greater NYC Area.",
        "image": "funk-fit-nyc.png",
        "url": "https://funktionalfitnessnyc.com/"
      },
      {
        "title": "Javascript Drumkit",
        "category": "A drumkit sampler using vanilla javascript and basic css",
        "image": "javascript-drumkit.png",
        "url": "https://5ff7b22d21c56d4dcf6e72a2--competent-shaw-4a9768.netlify.app"
      },
      {
        "title": "CSS Clock",
        "category": "A CSS clock created with vanilla javascript",
        "image": "cssjsclock.png",
        "url": "https://ecstatic-kare-335ade.netlify.app"
      },
      {
        "title": "CSS Variable Update with JavaScript",
        "category": "A css clock using vanilla javascript",
        "image": "cssjsupdate.png",
        "url": "https://naughty-archimedes-d4506c.netlify.app"
      },
      {
        "title": "Array Cardio Day One",
        "category": "A javascript practice to create and add objects to an array using vanilla js",
        "image": "arraycardiodayone.png",
        "url": "https://heuristic-joliot-410fa5.netlify.app"
      },
      {
        "title": "DogDayz Boarding and Training",
        "category": "A mock website for a local kennel service",
        "image": "dogdayz.png",
        "url": "https://goofy-kilby-651f9b.netlify.app"
      },
      {
        "title": "Joe's Pressure Washing Services",
        "category": "a website for a pressure washing service",
        "image": "",
        "url": "https://joespressurewashing.com"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I believe David would be a valuable addition to any team, especially a company that allows him to use his analytical and problem solving skills. Given the opportunity, I would enjoy working with David again.",
        "user": "Paul Yeskelawitch"
      }
    ]
  }
}
